---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.IFC.IFCGeometryInfo
source: html/af8f73a1-6be3-052e-c357-f105c176811d.htm
---
# IFCGeometryInfo Members

Creates a new container object which holds IfcCurve handles processed from a Revit geometry object.